Code/PresPrice/app/views/search/prices.html.erb


  <%medicine = Medicine.find(2)%>
---
SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]