Code/PresPrice/app/controllers/search_controller.rb

SELECT "searches".* FROM "searches"
---
	def index
		    @searches = Search.all