Code/PresPrice/app/controllers/search_controller.rb

SELECT "medicines".* FROM "medicines"
---
	def index
 		@medicines = Medicine.all

SELECT "medicines".* FROM "medicines" WHERE (name LIKE '%tylenol%' ) ORDER BY created_at DESC, name asc
---
	def results
	  #Results for one medicine search
	  @medicines = Medicine.all

SELECT "medicines".* FROM "medicines" WHERE (name LIKE '%tylenol%' ) ORDER BY created_at DESC, name asc
---
	def results2
		#Results for two medicine searches
		#creates separate medicines instances so they're printed separately
	  @medicines1 = Medicine.all